In [1]:
import pandas as pd 
import numpy as np

In [2]:
np.random.seed(42)

In [6]:
data = {
    'Çalışan': [f'Çalışan_{i}' for i in range(1, 11)],
    'Departman': np.random.choice(['IT', 'HR', 'Finans', 'Pazarlama'], 10),
    'Maaş': np.random.randint(3000, 15000, 10),
    'Yaş': np.random.randint(22, 60, 10)
}

In [8]:
df=pd.DataFrame(data)

In [9]:
df

      Çalışan  Departman   Maaş  Yaş
0   Çalışan_1         IT  13253   28
1   Çalışan_2     Finans  11433   29
2   Çalışan_3     Finans  13233   56
3   Çalışan_4         IT  14016   35
4   Çalışan_5         IT  10513   38
5   Çalışan_6     Finans   5612   57
6   Çalışan_7         HR  10041   25
7   Çalışan_8  Pazarlama  12555   23
8   Çalışan_9         IT   9235   27
9  Çalışan_10  Pazarlama   8486   25

In [13]:
df.loc[0:1,["Çalışan","Maaş"]]

     Çalışan   Maaş
0  Çalışan_1  13253
1  Çalışan_2  11433

In [14]:
df.iloc[0:2,[0,2]]

     Çalışan   Maaş
0  Çalışan_1  13253
1  Çalışan_2  11433

In [17]:
df.at[0,"Maaş"]

np.int32(13253)

In [18]:
df.iat[0,2]

np.int32(13253)

In [19]:
df.query("Maaş >10000")

     Çalışan  Departman   Maaş  Yaş
0  Çalışan_1         IT  13253   28
1  Çalışan_2     Finans  11433   29
2  Çalışan_3     Finans  13233   56
3  Çalışan_4         IT  14016   35
4  Çalışan_5         IT  10513   38
6  Çalışan_7         HR  10041   25
7  Çalışan_8  Pazarlama  12555   23

In [23]:
df.query('Maaş > 8000 and Departman == "IT"')

     Çalışan Departman   Maaş  Yaş
0  Çalışan_1        IT  13253   28
3  Çalışan_4        IT  14016   35
4  Çalışan_5        IT  10513   38
8  Çalışan_9        IT   9235   27

In [25]:
df[df['Departman'].isin(['IT', 'HR'])]

     Çalışan Departman   Maaş  Yaş
0  Çalışan_1        IT  13253   28
3  Çalışan_4        IT  14016   35
4  Çalışan_5        IT  10513   38
6  Çalışan_7        HR  10041   25
8  Çalışan_9        IT   9235   27

In [27]:
df[df["Maaş"].between(5000,10000)]

      Çalışan  Departman  Maaş  Yaş
5   Çalışan_6     Finans  5612   57
8   Çalışan_9         IT  9235   27
9  Çalışan_10  Pazarlama  8486   25

In [31]:
df["Maaş"].where(df["Maaş"] < 8000)

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
5    5612.0
6       NaN
7       NaN
8       NaN
9       NaN
Name: Maaş, dtype: float64

In [32]:
df["Maaş"].mask(df["Maaş"] < 8000)

0    13253.0
1    11433.0
2    13233.0
3    14016.0
4    10513.0
5        NaN
6    10041.0
7    12555.0
8     9235.0
9     8486.0
Name: Maaş, dtype: float64

In [33]:
df.sample(3)

     Çalışan Departman   Maaş  Yaş
2  Çalışan_3    Finans  13233   56
0  Çalışan_1        IT  13253   28
6  Çalışan_7        HR  10041   25

In [36]:
filter_df=df[df["Departman"].isin(["IT","Finans"]) & df["Maaş"].between(7000,12000)]

In [37]:
filter_df.sample(2)

     Çalışan Departman   Maaş  Yaş
8  Çalışan_9        IT   9235   27
1  Çalışan_2    Finans  11433   29